html/effj/common_method.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>通用方法</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="create_destroy_objects.html"> UP </a>
 |
 <a accesskey="H" href="effj.html"> HOME </a>
</div><div id="content">
<h1 class="title">通用方法</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">覆盖equals方法请遵守通用规定</a>
<ul>
<li><a href="#sec-1-1">不需要覆盖equals</a></li>
<li><a href="#sec-1-2">覆盖equals的通用约定</a></li>
<li><a href="#sec-1-3">实现高质量equals方法的诀窍</a></li>
</ul>
</li>
<li><a href="#sec-2">覆盖equals方法时永远覆盖hashcode方法</a></li>
<li><a href="#sec-3">永远覆盖toString方法</a></li>
<li><a href="#sec-4">谨慎覆盖clone方法</a>
<ul>
<li><a href="#sec-4-1">Cloneable接口</a></li>
<li><a href="#sec-4-2">clone方法的通用约定</a></li>
<li><a href="#sec-4-3">正确覆盖clone方法</a></li>
<li><a href="#sec-4-4">替代clone</a></li>
</ul>
</li>
<li><a href="#sec-5">如果有必要覆盖compareTo方法</a>
<ul>
<li><a href="#sec-5-1">compareTo方法的通用约定</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">覆盖equals方法请遵守通用规定</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">不需要覆盖equals</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>类的每个实例本质上都是唯一的，不变的
</li>
<li>不用关心类是否提供了“逻辑相等（logical equality）“
</li>
<li>超类已经覆盖了equals，从超类继承过来的行为对于子类也是合适的
</li>
<li>类是私有的或包级私有的，可以确定他的equals方法永远不会被调用
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">覆盖equals的通用约定</h3>
<div class="outline-text-3" id="text-1-2">
<p>
如果类具有自己特有的“逻辑想等”概念，而且超类还没有覆盖equals以实现期望的行为，这时就需要覆盖equals方法。这通常属于“值类”的情形 
</p>
<ul class="org-ul">
<li>自反性（reflexivity）：对于任何非空引用值 x，x.equals(x) 都应返回 true
</li>
<li>对称性（symmetry）：对于任何非空引用值 x 和 y，当且仅当 y.equals(x) 返回 true 时，x.equals(y) 才应返回 true
</li>
<li>传递性（transitivity）：对于任何非空引用值 x、y 和 z，如果 x.equals(y) 返回 true，并且 y.equals(z) 返回 true，那么 x.equals(z) 应返回 true
</li>
<li>一致性（consistency）：对于任何非空引用值 x 和 y，多次调用 x.equals(y) 始终返回 true 或始终返回 false，前提是对象上 equals 比较中所用的信息没有被修改
</li>
<li>非空性（Non-nullity）：对于任何非空引用值 x，x.equals(null) 都应返回 false
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">实现高质量equals方法的诀窍</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>使用==操作符检查“参数是否为这个对象的引用”
</li>
<li>使用instanceof操作符检查“参数是否为正确的类型”
</li>
<li>把参数转换成正确的类型
</li>
<li>对于该类中的每个“关键”域，检查参数中的域是否与该对象中对应的域相匹配（为了获得最佳性能，应该先比较最有可能不一致的域，或者开销最低的域，最理想的情况是两个条件同时满足的域）
</li>
<li>当编写完equals方法后，应该问自己三个问题：它是否是对称的、传递的和一致的
</li>
<li>覆盖equals时总要覆盖hashCode
</li>
<li>不要企图让equals方法过于智能
</li>
<li>不要将equals声明中的Object对象替换为其他类型
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">覆盖equals方法时永远覆盖hashcode方法</h2>
<div class="outline-text-2" id="text-2">
<p>
在每个覆盖了equals方法的类中，也必须覆盖hashCode方法。如果不那样做的话，就会违反Object.hashCode的通用约定，从而导致该类无法结合所有基于散列的集合一起正常运作，这样的集合包括HashMap、HashSet和Hashtable
</p>

<p>
正确的hashCode方法
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">A decent hashCode method</span>
<span style="color: #7fffd4;">@Override</span> <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">int</span> <span style="color: #87cefa;">hashCode</span>() {
    <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">result</span> = 17;
    result = 31  -  result + areaCode;
    result = 31  -  result + prefix;
    result = 31  -  result + lineNumber;
    <span style="color: #00ffff;">return</span> result;
}
</pre>
</div>
<p>
用移位和减法来代替乘法，可以得到更好的性能：31 - i == (i&lt;&lt;5)-i 
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">永远覆盖toString方法</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>提供好的toString实现可以使类用起来更加舒适，当对象被传递给println、printf、字符串练操作符（+）以及assert或者被调试器打印出来时，toString方法会被自动调用
</li>
<li>toString方法应该返回对象中包含的所有值得关注的信息
</li>
<li>在文档中指定返回值的格式
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">谨慎覆盖clone方法</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">Cloneable接口</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Cloneable接口只是表示某个类可以被克隆，如果某个类不实现Cloneable，调用super.clone会抛出CloneNotSupportedException，但接口本身并没有定义clone方法。clone方法存在于Object中，并且是protected。想要被克隆的类需要自己实现clone方法，而且不能是私有的
</p>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">clone方法的通用约定</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li>x.clone() != x
</li>
<li>x.clone().getClass() == x.getClass()
</li>
<li>x.clone().equals(x)
</li>
<li>不调用构造器
</li>
</ol>
<p>
但这都不是绝对要求，clone方法的通用约定是非常脆弱的
</p>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3">正确覆盖clone方法</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>非final子类中被覆盖的clone方法应该返回super.clone，否则将会返回错误的class类型
</li>
<li>如果一个类只有原始变量类型和final类型的成员时候，调用super.clone就能正确克隆
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">PhoneNumber</span> {
    <span style="color: #00ffff;">private</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">areaCode</span>;
    <span style="color: #00ffff;">private</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">countryCode</span>;
    <span style="color: #00ffff;">private</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">number</span>;
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">String</span> <span style="color: #eedd82;">prefix</span>;

    <span style="color: #7fffd4;">@Override</span> <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">PhoneNumber</span> <span style="color: #87cefa;">clone</span>() {
        <span style="color: #00ffff;">try</span> {
            <span style="color: #00ffff;">return</span> (PhoneNumber) <span style="color: #00ffff;">super</span>.clone();
        } <span style="color: #00ffff;">catch</span>(<span style="color: #98fb98;">CloneNotSupportedException</span> <span style="color: #eedd82;">e</span>) {
            <span style="color: #00ffff;">throw</span> <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">AssertionError</span>(); <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Can't happen</span>
        }
    }
}
</pre>
</div>
</li>
<li>克隆必须保证将来不会伤害到原始的对象，并确保正确地创建被克隆对象中的约束条件。因此如果对象有可变的成员时候，只是调用super.clone是不足够的，必须逐个成员进行clone
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Stack</span> {
    <span style="color: #00ffff;">private</span> <span style="color: #98fb98;">Object</span>[] <span style="color: #eedd82;">elements</span>;
    <span style="color: #00ffff;">private</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">size</span> = 0;
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">static</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">DEFAULT_INITIAL_CAPACITY</span> = 16;

    <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">Stack</span>() {
        <span style="color: #00ffff;">this</span>.elements = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Object</span>[DEFAULT_INITIAL_CAPACITY];
    }

    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">push</span>(<span style="color: #98fb98;">Object</span> <span style="color: #eedd82;">e</span>) {
        ensureCapacity();
        elements[size++] = e;
    }

    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">Object</span> <span style="color: #87cefa;">pop</span>() {
        <span style="color: #00ffff;">if</span> (size == 0)
            <span style="color: #00ffff;">throw</span> <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">EmptyStackException</span>();
        <span style="color: #98fb98;">Object</span> <span style="color: #eedd82;">result</span> = elements[--size];
        elements[size] = <span style="color: #7fffd4;">null</span>; <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Eliminate obsolete reference</span>
        <span style="color: #00ffff;">return</span> result;
    }
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">Ensure space for at least one more element.</span>
    <span style="color: #00ffff;">private</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">ensureCapacity</span>() {
        <span style="color: #00ffff;">if</span> (elements.length == size)
            elements = Arrays.copyOf(elements, 2 * size + 1);
    }
}
</pre>
</div>
</li>
</ul>
<p>
简单调用super.clone会导致克隆对象的成员elements没有被正确复制，只是和旧的elements拥有相同引用，这意味着当克隆对象调用pop，push方法，旧的对象elements数组也会被修改
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #7fffd4;">@Override</span> <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">Stack</span> <span style="color: #87cefa;">clone</span>() {
    <span style="color: #00ffff;">try</span> {
        <span style="color: #98fb98;">Stack</span> <span style="color: #eedd82;">result</span> = (Stack) <span style="color: #00ffff;">super</span>.clone();
        result.elements = elements.clone();
        <span style="color: #00ffff;">return</span> result;
    } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">CloneNotSupportedException</span> <span style="color: #eedd82;">e</span>) {
        <span style="color: #00ffff;">throw</span> <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">AssertionError</span>();
    }
}
</pre>
</div>
<p>
clone方法与可变对象的final域是不兼容的，因为这会影响到旧的对象
</p>
<ul class="org-ul">
<li>某些情况下，简单的调用成员clone方法仍然不够，必须手动复制
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">HashTable</span> <span style="color: #00ffff;">implements</span> <span style="color: #98fb98;">Cloneable</span> {
    <span style="color: #00ffff;">private</span> <span style="color: #98fb98;">Entry</span>[] <span style="color: #eedd82;">buckets</span> = ...;
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">static</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Entry</span> {
        <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Object</span> <span style="color: #eedd82;">key</span>;
        <span style="color: #98fb98;">Object</span> <span style="color: #eedd82;">value</span>;
        <span style="color: #98fb98;">Entry</span> <span style="color: #eedd82;">next</span>;
        <span style="color: #87cefa;">Entry</span>(<span style="color: #98fb98;">Object</span> <span style="color: #eedd82;">key</span>, <span style="color: #98fb98;">Object</span> <span style="color: #eedd82;">value</span>, <span style="color: #98fb98;">Entry</span> <span style="color: #eedd82;">next</span>) {
            <span style="color: #00ffff;">this</span>.key = key;
            <span style="color: #00ffff;">this</span>.value = value;
            <span style="color: #00ffff;">this</span>.next = next;
        }
    }
    <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Remainder omitted</span>

    <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Broken - results in shared internal state!</span>
    <span style="color: #7fffd4;">@Override</span> <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">HashTable</span> <span style="color: #87cefa;">clone</span>() {
        <span style="color: #00ffff;">try</span> {
            <span style="color: #98fb98;">HashTable</span> <span style="color: #eedd82;">result</span> = (HashTable) <span style="color: #00ffff;">super</span>.clone();
            result.buckets = buckets.clone();
            <span style="color: #00ffff;">return</span> result;
        } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">CloneNotSupportedException</span> <span style="color: #eedd82;">e</span>) {
            <span style="color: #00ffff;">throw</span> <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">AssertionError</span>();
        }
    }
}
</pre>
</div>
</li>
</ul>
<p>
虽然buckets对象被克隆了，但是这个数组中的对象还是和被克隆的拥有相同的对象引用，这种情况下必须手动进行deep copy　
</p>


<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">HashTable</span> <span style="color: #00ffff;">implements</span> <span style="color: #98fb98;">Cloneable</span> {
    <span style="color: #00ffff;">private</span> <span style="color: #98fb98;">Entry</span>[] <span style="color: #eedd82;">buckets</span> = ...;
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">static</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Entry</span> {
        <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Object</span> <span style="color: #eedd82;">key</span>;
        <span style="color: #98fb98;">Object</span> <span style="color: #eedd82;">value</span>;
        <span style="color: #98fb98;">Entry</span> <span style="color: #eedd82;">next</span>;
        <span style="color: #87cefa;">Entry</span>(<span style="color: #98fb98;">Object</span> <span style="color: #eedd82;">key</span>, <span style="color: #98fb98;">Object</span> <span style="color: #eedd82;">value</span>, <span style="color: #98fb98;">Entry</span> <span style="color: #eedd82;">next</span>) {
            <span style="color: #00ffff;">this</span>.key = key;
            <span style="color: #00ffff;">this</span>.value = value;
            <span style="color: #00ffff;">this</span>.next = next;
        }
        <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Recursively copy the linked list headed by this Entry</span>
        <span style="color: #98fb98;">Entry</span> <span style="color: #87cefa;">deepCopy</span>() {
            <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Entry</span>(key, value,
                     next == <span style="color: #7fffd4;">null</span> ? <span style="color: #7fffd4;">null</span> : next.deepCopy());
        }
    }

    <span style="color: #7fffd4;">@Override</span> <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">HashTable</span> <span style="color: #87cefa;">clone</span>() {
        <span style="color: #00ffff;">try</span> {
            <span style="color: #98fb98;">HashTable</span> <span style="color: #eedd82;">result</span> = (HashTable) <span style="color: #00ffff;">super</span>.clone();
            result.buckets = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Entry</span>[buckets.length];
            <span style="color: #00ffff;">for</span> (<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">i</span> = 0; i &lt; buckets.<span style="color: #98fb98;">length</span>; i++)
                <span style="color: #00ffff;">if</span> (buckets[i] != <span style="color: #7fffd4;">null</span>)
                    result.buckets[i] = buckets[i].deepCopy();
            <span style="color: #00ffff;">return</span> result;
        } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">CloneNotSupportedException</span> <span style="color: #eedd82;">e</span>) {
            <span style="color: #00ffff;">throw</span> <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">AssertionError</span>();
        }
    }
    ... <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Remainder omitted</span>
}
</pre>
</div>
<ul class="org-ul">
<li>clone方法需要考虑线程安全，实现同步
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4">替代clone</h3>
<div class="outline-text-3" id="text-4-4">
<ol class="org-ol">
<li>使用拷贝构造器
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #87cefa;">Yum</span>(<span style="color: #98fb98;">Yum</span> <span style="color: #eedd82;">yum</span>);
</pre>
</div>
</li>
<li>使用拷贝静态工厂
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">Yum</span> <span style="color: #87cefa;">newInstance</span>(<span style="color: #98fb98;">Yum</span> <span style="color: #eedd82;">yum</span>);
</pre>
</div>
</li>
<li>使用不变类，克隆不变类毫无意义
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">如果有必要覆盖compareTo方法</h2>
<div class="outline-text-2" id="text-5">
<p>
当实现“值”类的时候，非常有必要继承Comparable接口，实现compareTo方法, 可以方便TreeSet, TreeMap等容器类的使用
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">compareTo方法的通用约定</h3>
<div class="outline-text-3" id="text-5-1">
<p>
sgn(expression)符号表示数学中的signum函数，即根据expression是负数、零、或正数，分别返回-1、0、1
</p>
<ul class="org-ul">
<li>对称性：必须保证对所有的x和y都有sgn(x.compareTo(y)) == -sgn(y.compareTo(x))。这也暗示当且仅当y.compareTo(x)抛出异常时，x.compareTo(y)才抛出异常
</li>
<li>传递性：必须保证比较关系是可传递的，如果x.compareTo(y) &gt; 0 且y.compareTo(z) &gt; 0，则x.compareTo(z) &gt; 0
</li>
<li>必须保证x.compareTo(y) <code>= 0 暗示着所有的z都有(x.compareTo(z)) =</code> (y.compareTo(z))
</li>
<li>虽不强制要求，但强烈建议(x.compareTo(y) <code>= 0) =</code> (x.equals(y))。一般来说，任何实现了Comparable的类如果违反了这个约定，都应该明确说明
</li>
</ul>

<p>
<a href="class_interface.html">Next：类和接口</a>
</p>

<p>
<a href="create_destroy_objects.html">Previous：创建和销毁对象</a> 
</p>

<p>
<a href="effj.html">Home：目录</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

     <br/>
    <div class='ds-thread'></div>
<script>
var duoshuoQuery = {short_name:'klose911'};
(function() {
	 var dsThread = document.getElementsByClassName('ds-thread')[0];
         dsThread.setAttribute('data-thread-key', document.title);
         dsThread.setAttribute('data-title', document.title);
         dsThread.setAttribute('data-url', window.location.href);
	 var ds = document.createElement('script');
	 ds.type = 'text/javascript';ds.async = true;
	 ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
	 ds.charset = 'UTF-8';
	 (document.getElementsByTagName('head')[0] 
				       || document.getElementsByTagName('body')[0]).appendChild(ds);
				       })();
</script>
<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
  ga('create', 'UA-90850421-1', 'auto');
  ga('send', 'pageview');
</script>
</div>
</body>
</html>
